[
  {
    "category": "Common Questions",
    "question_en": "What is the minimum fitness level required to participate?",
    "answer_en": "Our tours are designed for cyclists with a moderate fitness level. You should be able to ride for 60-80 km per day on varied terrain, including challenging climbs. We recommend training regularly for at least 2-3 months before the trip, with rides of at least 50 km. If you have doubts about your fitness level, contact us for a personalized assessment."
  },
  {
    "category": "Common Questions",
    "question_en": "What is the average level of the participants?",
    "answer_en": "Our groups are mainly composed of passionate amateur cyclists between the ages of 35 and 55. Most have road cycling experience and regularly participate in granfondos or cycling events. We always create an inclusive environment where everyone can ride at their own pace, supported by the group."
  },
  {
    "category": "Common Questions",
    "question_en": "What is the average speed during the tours?",
    "answer_en": "The average speed varies between 22 and 28 km/h depending on the route and the group's condition. During the climbs, the speed naturally decreases, while on flat or downhill sections it can increase. Our goal is not speed, but the pleasure of riding together in safety."
  },
  {
    "category": "Common Questions",
    "question_en": "Am I too old for this type of experience?",
    "answer_en": "Absolutely not! Age is just a number when it comes to a passion for cycling. We have hosted cyclists of all ages, from 25 to 75 years old. What matters is motivation, adequate physical preparation, and enthusiasm for the adventure. Many of our more \"experienced\" participants are often the ones who have the most fun!"
  },
  {
    "category": "Common Questions",
    "question_en": "Can I come with my partner who doesn't cycle?",
    "answer_en": "Certainly! We offer alternative programs for non-cycling travel companions. While you ride, your partner can explore Palma, relax on the beach, visit museums, or participate in cultural tours. In the evening you will meet for dinners and common activities. Contact us to organize a personalized program."
  },
  {
    "category": "Common Questions",
    "question_en": "Is it a mixed training camp?",
    "answer_en": "Yes, our tours welcome cyclists of both sexes. We believe that diversity enriches the group experience. We always guarantee appropriate accommodation and a respectful environment for all participants."
  },
  {
    "category": "Common Questions",
    "question_en": "What language is spoken during the tour?",
    "answer_en": "Our tours are mainly held in English, French, or Italian. Our guides are multilingual and adapt to the composition of the group. We always provide translations when necessary to ensure that everyone can fully participate in the experience."
  },
  {
    "category": "Common Questions",
    "question_en": "Are all your cycling tours the same?",
    "answer_en": "Each tour is unique and personalized based on the destination, season, and group composition. Although some iconic routes like Sa Calobra are present in several tours, the overall experience always varies. We offer different levels of intensity and thematic focus to satisfy different preferences."
  },
  {
    "category": "Common Questions",
    "question_en": "What is the best time to join a tour in Mallorca?",
    "answer_en": "March-April-May-June and September-October are the ideal periods, with mild temperatures (18-25°C) and less tourist traffic. Summer can be very hot, while winter offers pleasant temperatures but with possible rain. Each season has its advantages: contact us to choose the most suitable period for your preferences."
  },
  {
    "category": "Common Questions",
    "question_en": "How many people will I be cycling with?",
    "answer_en": "Our groups are limited to a maximum of 12 participants to ensure a personalized and safe experience. This number allows us to maintain cohesion in the group, offer individual attention and access routes and facilities that would not be available for larger groups."
  },
  {
    "category": "Women-Only Tours",
    "question_en": "Information about Women-Only Tours",
    "answer_en": "We are currently working on a dedicated FAQ section for our women-only tours. Please contact us for more information."
  },
  {
    "category": "Booking",
    "question_en": "How can I book?",
    "answer_en": "You can book directly on our website by selecting the desired tour and date. We require a deposit of 100 Euro to confirm the booking, with the balance to be paid 30 days before departure. We accept payments by credit card, bank transfer, or PayPal."
  },
  {
    "category": "Booking",
    "question_en": "When do I have to pay?",
    "answer_en": "A deposit of 100 Euro is required at the time of booking. The remaining balance must be paid within 30 days of departure. For bookings made less than 30 days before departure, full payment is required immediately."
  },
  {
    "category": "Booking",
    "question_en": "What happens if I have to cancel the trip?",
    "answer_en": "We offer a flexible cancellation policy: Within 60 days: full refund of the €100. Less than 60 days: no refund, except in exceptional circumstances. We strongly recommend that you take out travel insurance to cover unexpected cancellations."
  },
  {
    "category": "Booking",
    "question_en": "How far in advance should I book?",
    "answer_en": "We recommend booking at least 3-4 months in advance, especially for the spring and autumn tours which are in high demand. Some tours fill up quickly, so the sooner you book, the better your chances of securing a place on your preferred date."
  },
  {
    "category": "Booking",
    "question_en": "Is there a minimum number of participants required?",
    "answer_en": "Yes, we require a minimum of 4 participants to confirm a tour. If we do not reach the minimum number, we will offer you the option to transfer your booking to another date or receive a full refund. We will inform you at least 21 days before departure."
  },
  {
    "category": "Booking",
    "question_en": "Is there a minimum age to participate?",
    "answer_en": "The minimum age is 18. For participants between 16 and 18 years of age, written authorization from the parents and the presence of a responsible adult companion are required. We do not have a maximum age: what matters is physical fitness and a passion for cycling."
  },
  {
    "category": "Booking",
    "question_en": "Will you add more dates if all tours are sold out?",
    "answer_en": "Whenever possible, we try to add extra dates for the most popular tours. However, this depends on the availability of facilities, guides and logistical conditions. We recommend that you subscribe to our waiting list to be the first to be informed of any new dates."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "What is the minimum fitness level required?",
    "answer_en": "You should be able to ride 60-80 km per day on varied terrain with gradients of up to 1,500 meters. It is important to have road cycling experience and be used to prolonged climbs. We recommend regular training of at least 200 km per week in the months leading up to the tour."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "What is the average speed maintained?",
    "answer_en": "The speed varies between 22-28 km/h on flat and hilly sections. During important climbs like Sa Calobra, the speed naturally reduces to 12-18 km/h. We always organize the group so that no one is left behind, with regular meeting points."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "What is the minimum FTP required?",
    "answer_en": "We do not require a specific FTP, but as a reference, an FTP of at least 2.5-3 W/kg will allow you to fully enjoy the tours without excessive fatigue. If you have a power meter, we will be happy to help you interpret the data to assess your preparation."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "How many kilometers will we ride per day?",
    "answer_en": "The routes vary between 50 and 100 km per day, with an average of 70-80 km. The most demanding days include iconic climbs such as Sa Calobra (90 km), while recovery days are shorter (50-60 km). We always provide alternative routes for those who want to ride more or less."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "I am not a professional or a racer, can I still participate?",
    "answer_en": "Absolutely yes! Our tours are designed for passionate cyclists, not for professionals. What matters is the love for cycling, adequate physical preparation and the desire to live an unforgettable experience. Many of our most satisfied guests are amateur cyclists."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "I am a strong cyclist, will it be challenging enough?",
    "answer_en": "Our tours include some of the most iconic and challenging climbs in the world of cycling. Sa Calobra, with its 9.5 km at an average of 7%, and other climbs in the Serra de Tramuntana will offer adequate challenges even for the most prepared cyclists. We can always suggest more challenging variations for those looking for the ultimate challenge."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "Do you offer tours for beginners?",
    "answer_en": "Currently our tours are designed for intermediate-advanced cyclists. However, we are developing specific programs for beginners with more accessible routes and additional technical support. Contact us to be informed about future tours dedicated to beginners."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "How are the routes organized?",
    "answer_en": "Each day begins with a detailed briefing of the route, including points of interest, technical difficulties and refreshment points. We use GPS and detailed maps, with expert guides who know every meter of the routes. We always have a support vehicle that follows the group."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "How is the group's pace managed?",
    "answer_en": "We organize the group according to the level and preferences of each one. When necessary, we divide into subgroups with different rhythms, always with qualified guides. No one is ever left behind, and we have regular meeting points to maintain group cohesion."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "How do the feed zones work?",
    "answer_en": "On demand, we organize strategic stops every 25-30 km with supplies of water, supplements, fruit and energy snacks. On longer routes, we include stops in local cafes for an authentic cultural experience. The support vehicle always carries additional supplies."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "Are there coffee stops during the routes?",
    "answer_en": "Certainly! Coffee stops are an integral part of cycling culture. We select the best local bars along the routes, where you can taste authentic Spanish coffee and socialize with the group. These stops are also perfect moments for photos and relaxation."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "Single or double file when riding?",
    "answer_en": "We ride mainly in single file for safety reasons, especially on busy or narrow roads. On wide and safe roads, we allow double file to encourage socialization. Our guides always provide clear instructions on the formations to be maintained."
  },
  {
    "category": "Fitness Level and Routes",
    "question_en": "What kind of preparation do you recommend?",
    "answer_en": "We recommend a progressive training program of at least 12 weeks before the tour. It includes long outings (80-120 km), hill training, and endurance work. We provide personalized training plans to registered participants. Mental training is just as important as physical training."
  },
  {
    "category": "Bicycles",
    "question_en": "Is bike rental included in the price?",
    "answer_en": "Yes, premium bicycle rental is included in the tour price. We offer high-quality racing bikes from the best brands, perfectly maintained and suitable for all types of terrain. Each bike is assigned after a professional bike fitting to ensure maximum comfort."
  },
  {
    "category": "Bicycles",
    "question_en": "What kind of bicycles will we use?",
    "answer_en": "We use carbon frame racing bikes from premium brands such as Basso, De Rosa and Officine Mattio. All bikes are recent models, equipped with Shimano Ultegra or higher groupsets, lightweight wheels and quality tires. Each bike is checked and maintained daily."
  },
  {
    "category": "Bicycles",
    "question_en": "Can I choose between different bicycle models?",
    "answer_en": "We offer a selection of models based on availability and your preferences. You can choose between more aggressive geometries for maximum performance or more comfortable ones for long distances. During the booking process, we collect your preferences to assign you the most suitable bike."
  },
  {
    "category": "Bicycles",
    "question_en": "Is it possible to upgrade the wheels?",
    "answer_en": "Yes, we offer wheel upgrades with high-quality carbon sets for a supplement of €150 for the entire tour. These upgrades include lighter and more aerodynamic wheels that significantly improve performance, especially on climbs and against the wind."
  },
  {
    "category": "Bicycles",
    "question_en": "What gears do the rental bikes have?",
    "answer_en": "Our bikes are equipped with compact ratios (50/34 front and 11-32 rear) ideal for the challenging climbs of Mallorca. This setup allows you to tackle even the steepest climbs while maintaining a comfortable cadence. On request, we can provide different ratios."
  },
  {
    "category": "Bicycles",
    "question_en": "Do you provide pedals?",
    "answer_en": "We provide standard SPD-SL (Look) pedals. If you use a different system (SPD, Speedplay, Time), you can bring your own pedals which we will mount on your bike for free. We recommend bringing your usual shoes and pedals for maximum comfort."
  },
  {
    "category": "Bicycles",
    "question_en": "How are the brakes adjusted?",
    "answer_en": "All our bikes have perfectly adjusted and tested hydraulic disc brakes. The brakes are set according to European standards (right lever = rear brake)."
  },
  {
    "category": "Bicycles",
    "question_en": "Can I bring my own bicycle?",
    "answer_en": "Absolutely yes! Many cyclists prefer to use their own bike. We offer a €200 discount on the tour price if you bring your own bicycle. We provide assistance for air transport and free technical checks. Make sure your bike is in perfect condition before the trip."
  },
  {
    "category": "Bicycles",
    "question_en": "Is there a discount if I bring my own bike?",
    "answer_en": "Yes, we offer a €200 discount if you use your personal bicycle. This discount reflects the savings on rental and maintenance costs. However, you will have to take care of the air transport and make sure that the bike is in perfect mechanical condition."
  },
  {
    "category": "Bicycles",
    "question_en": "Can I bring my power meter?",
    "answer_en": "Certainly! If you have a personal power meter, we can mount it on the rental bike (compatibility permitting) or you can use it on your personal bike. The power data is very useful for monitoring performance during iconic climbs such as Sa Calobra."
  },
  {
    "category": "Bicycles",
    "question_en": "What frame size do you recommend?",
    "answer_en": "We carry out a professional bike fitting with our IDMATCH system on the first day to determine the optimal size and adjustment. We collect your measurements during booking, but the final adjustment is always done in person. Comfort is essential to fully enjoy the experience. Customers from Geneva can carry out the Bike Fitting directly in Geneva before the Bike Tour."
  },
  {
    "category": "Bicycles",
    "question_en": "Can I participate with an e-bike?",
    "answer_en": "Currently our tours are designed for traditional bicycles. However, we are considering the introduction of specific tours for e-bikes that would allow cyclists with different fitness levels to participate together. Contact us to be informed about future developments."
  },
  {
    "category": "Bicycles",
    "question_en": "Do you provide a saddlebag?",
    "answer_en": "Yes, each bike is equipped with a saddlebag containing a basic repair kit (inner tubes, levers, mini-pump). However, our support vehicle always carries complete equipment for more complex repairs. We also recommend that you bring your own favorite tools."
  },
  {
    "category": "Kit and Apparel",
    "question_en": "What kit or accessories should I bring?",
    "answer_en": "We will provide a detailed list after booking, but the essentials include: helmet (mandatory), cycling shoes, technical clothing for different weather conditions, sunglasses, sunscreen, and personal repair kit. We recommend layered clothing to adapt to temperature variations."
  },
  {
    "category": "Kit and Apparel",
    "question_en": "Is the kit included in the tour price?",
    "answer_en": "Yes, you will receive a complete welcome kit that includes a high-quality jersey and shorts. This kit is not only a souvenir, but technical clothing that you can use during and after the tour. The materials are selected for comfort and performance."
  },
  {
    "category": "Kit and Apparel",
    "question_en": "Can I receive a winter kit instead?",
    "answer_en": "If your tour takes place in the cooler months (November-March), the kit will automatically include items more suited to winter temperatures: long-sleeved thermal jersey, windproof vest and leg warmers. We always adapt the kit to the season and the expected conditions."
  },
  {
    "category": "Kit and Apparel",
    "question_en": "Can I buy additional kit?",
    "answer_en": "Certainly! We offer the possibility to purchase additional kits with a 30% discount on the list prices. You can order extra items during booking or during the tour. Many participants buy additional kits as gifts for cycling friends."
  },
  {
    "category": "Kit and Apparel",
    "question_en": "Can we buy the kits without participating in the tour?",
    "answer_en": "Currently our exclusive kits are reserved for tour participants. However, we are considering the possibility of opening an online store for former participants and enthusiasts. Subscribe to our newsletter to be informed about future developments."
  },
  {
    "category": "Kit and Apparel",
    "question_en": "Is the kit of good quality?",
    "answer_en": "Our kits are produced by specialized technical brands using high-quality fabrics with breathable, antibacterial and quick-drying properties. We collaborate with suppliers who produce for professional teams, guaranteeing high quality standards. Many participants continue to use the kit for years."
  },
  {
    "category": "Kit and Apparel",
    "question_en": "How much does the kit cost?",
    "answer_en": "The basic kit (jersey, shorts, socks) is included in the tour price. Additional kits are available for €180 for a full set, with discounts for multiple orders. Single items are available from €85 for jerseys and €120 for shorts."
  },
  {
    "category": "Massages and Recovery",
    "question_en": "How many massages will I receive?",
    "answer_en": "On demand, participants can have a professional massage a day after the most demanding outings. The massages are performed by qualified therapists specializing in sports and cycling. On recovery days or with shorter routes, we offer guided stretching sessions and use of recovery tools."
  },
  {
    "category": "Massages and Recovery",
    "question_en": "How long are the massage sessions?",
    "answer_en": "Each session lasts 30-45 minutes and focuses on the legs, back and areas most stressed by cycling. The massages are personalized according to your specific needs and the sensations of the day. The therapists adapt the intensity and techniques to your preferences."
  },
  {
    "category": "Massages and Recovery",
    "question_en": "Do I have to be completely undressed?",
    "answer_en": "No, it is not necessary. Sports massages focus on the legs and back, so you can keep your underwear on. We always provide towels and guarantee maximum privacy and professionalism. The goal is your comfort and recovery, there are no particular obligations."
  },
  {
    "category": "Massages and Recovery",
    "question_en": "Will the massage hurt?",
    "answer_en": "Sports massages can be more intense than relaxing ones, but they should never be painful. Our therapists are experts in finding the right balance between effectiveness and comfort. Always communicate your feelings during the treatment to adapt the pressure and intensity."
  },
  {
    "category": "Massages and Recovery",
    "question_en": "How much does a massage cost?",
    "answer_en": "The massages included in the price in the Luxury formula, for classic tours a massage costs €60 per 45-minute session. Many participants appreciate the treatments so much that they book extra sessions for maximum recovery."
  },
  {
    "category": "Your Stay",
    "question_en": "Where is the hotel located?",
    "answer_en": "We have several partner hotels in Palma, all located in \"strategic\" positions, so you can. The location allows easy access to the tour starting points and the city's attractions. The hotel offers specific services for cyclists, including secure bicycle storage."
  },
  {
    "category": "Your Stay",
    "question_en": "Are airport transfers included?",
    "answer_en": "Yes, we provide free transfers from Palma airport to the hotel and back at standard times (arrivals 14:00-20:00, departures 08:00-14:00). For arrivals or departures outside these times, we offer private transfers with a supplement of €35 per way."
  },
  {
    "category": "Your Stay",
    "question_en": "What are the airport transfer times?",
    "answer_en": "Group transfers depart from the airport at 15:00, 17:00 and 19:00 on the day of arrival, and from the hotel at 09:00, 11:00 and 13:00 on the day of departure. These times cover most European flights. We will confirm the exact times 7 days before departure."
  },
  {
    "category": "Your Stay",
    "question_en": "Why is there an extra cost for transfers at different times?",
    "answer_en": "Transfers outside standard hours require private rather than shared services, increasing operating costs. The supplement of €35 covers the additional cost of the private transfer and guarantees flexibility for those who have flights at particular times."
  },
  {
    "category": "Your Stay",
    "question_en": "Can I have a single room?",
    "answer_en": "Certainly! The single room upgrade is available with a supplement of €350 for the entire stay. Single rooms are limited, so we recommend booking in advance. All rooms, single or double, have a private bathroom and full services."
  },
  {
    "category": "Your Stay",
    "question_en": "As a woman, will I have to share a room with a man?",
    "answer_en": "Absolutely not. We always organize accommodation respecting gender, unless there are specific different requests (for example, couples). Women share rooms with other women, and men with other men. We always guarantee comfort and privacy for all participants."
  },
  {
    "category": "Your Stay",
    "question_en": "Should I tip the hotel staff?",
    "answer_en": "Tipping is not mandatory but is appreciated for excellent service. As a reference, €1-2 per day for the cleaning service and €5-10 total for the reception staff are considered appropriate. The hotel staff is always very professional and helpful."
  },
  {
    "category": "Your Stay",
    "question_en": "What meals are included?",
    "answer_en": "All breakfasts and dinners are included. The breakfasts are plentiful and balanced to provide energy for the outings. The dinners include local specialties and dishes suitable for post-workout recovery. Lunches are not included to allow flexibility during the outings and to discover the local cuisine."
  },
  {
    "category": "Your Stay",
    "question_en": "I am a vegetarian, is that a problem?",
    "answer_en": "No problem! Mallorca offers excellent vegetarian and vegan options. Inform us of your dietary needs when booking and we will arrange appropriate menus. Mediterranean cuisine is naturally rich in fresh and nutritious plant-based options."
  },
  {
    "category": "Your Stay",
    "question_en": "Are there different menu options?",
    "answer_en": "Yes, we offer varied menus every evening to satisfy different tastes and nutritional needs. We always include options for vegetarians, vegans and people with food intolerances. The menus are designed by sports nutritionists to optimize recovery and performance."
  },
  {
    "category": "Your Stay",
    "question_en": "Are local tourist taxes included?",
    "answer_en": "The tourist taxes (about €2-4 per person per night) are not included in the tour price and must be paid directly to the hotel at check-out. This is standard for all accommodation in the Balearic Islands and the exact cost depends on the category of the hotel."
  },
  {
    "category": "Your Stay",
    "question_en": "Can I do laundry on site?",
    "answer_en": "The hotel offers a paid laundry service (about €15-20 per load). Many rooms also have drying racks for drying technical clothing. We recommend bringing enough clothing for the entire stay, considering that technical clothing dries quickly."
  },
  {
    "category": "Your Stay",
    "question_en": "Can I participate in the activities but stay elsewhere?",
    "answer_en": "It is possible, but not recommended because you would miss the full group experience and some included services. If you choose this option, we offer a €400 discount on the tour price. However, you will have to organize your own transport to reach the starting points of the outings."
  },
  {
    "category": "Your Stay",
    "question_en": "Are there activities for non-cyclists?",
    "answer_en": "Yes, we organize alternative programs for non-cycling travel companions: cultural tours of Palma, excursions to the most beautiful beaches, visits to museums and local markets, spa and wellness sessions. These programs allow you to explore Mallorca from a different perspective."
  },
  {
    "category": "Your Stay",
    "question_en": "Can I come with my children?",
    "answer_en": "Our tours are designed for adults and require a level of fitness and concentration not suitable for children. However, we are developing family-friendly programs for the future. Contact us to discuss specific options if you have special needs."
  },
  {
    "category": "Trip Preparation",
    "question_en": "What is the nearest airport?",
    "answer_en": "Palma Airport (PMI) is the only airport in Mallorca and is about 15 minutes from the hotel. It is well connected with all major European cities with direct flights. The airport is modern and efficient, with good services for travelers with sports equipment. If the tour is organized with a hotel stay in the northern part of the island, a transfer of about 45 minutes must be expected."
  },
  {
    "category": "Trip Preparation",
    "question_en": "Is there a preferred time for arrival and departure?",
    "answer_en": "We recommend arriving in the afternoon (14:00-18:00) on the first day to participate in the evening briefing and welcome dinner. For departure, we suggest flights after 14:00 on the last day to allow for a relaxed check-out and any last-minute purchases."
  },
  {
    "category": "Trip Preparation",
    "question_en": "How should I pack my suitcase?",
    "answer_en": "We will provide a detailed list after booking. Essentials: technical clothing for different weather conditions, cycling shoes, helmet, personal repair kit. We recommend suitcases with wheels for ease of transport and waterproof bags to protect electronics."
  },
  {
    "category": "Trip Preparation",
    "question_en": "Are flights included?",
    "answer_en": "Flights are not included to offer you maximum flexibility in choosing departure times, companies and airports. This also allows you to extend your stay or combine the tour with other destinations. We can provide advice on recommended flights and companies."
  },
  {
    "category": "Trip Preparation",
    "question_en": "How much do flights to Mallorca usually cost?",
    "answer_en": "Costs vary from €50 to €400 round trip depending on the season, how far in advance you book and the city of departure. Flights are generally cheaper in the low season months (November-March) and by booking in advance. Monitor the offers of low-cost airlines for the best prices."
  },
  {
    "category": "Trip Preparation",
    "question_en": "Do you have any tips for jet lag?",
    "answer_en": "Jet lag is not a problem for Mallorca from European destinations, as it is in the same time zone or with minimal differences. For more distant destinations, we recommend arriving 1-2 days earlier to adapt. Stay hydrated during the flight and expose yourself to sunlight upon arrival."
  },
  {
    "category": "Trip Preparation",
    "question_en": "Is it possible to arrive a day early to limit the effects of jet lag?",
    "answer_en": "Certainly! Many participants choose to arrive early to explore Palma or relax before the tour. We can help you extend your hotel booking under the same conditions. This also allows you to adapt to the time zone and start the tour more rested."
  },
  {
    "category": "Trip Preparation",
    "question_en": "What training do you recommend the week before the tour?",
    "answer_en": "The week before should be an active deload: reduce the volume by 50% but maintain moderate intensity. Do 2-3 short outings (30-50 km) with some sprints to keep your legs responsive. Avoid intense workouts in the last 3 days. Prioritize rest and hydration."
  },
  {
    "category": "Trip Preparation",
    "question_en": "Do I need special insurance?",
    "answer_en": "We strongly recommend comprehensive travel insurance that covers sports activities, cancellations, medical expenses and equipment damage. Check that your insurance specifically covers sport cycling. We can recommend companies specializing in sports tourism."
  },
  {
    "category": "Trip Preparation",
    "question_en": "Should I bring my own energy bars and drinks?",
    "answer_en": "We provide complete supplies during the outings, but many cyclists prefer their usual products. You can bring your favorite supplements or buy them locally. Bike Tours has its own boutique where customers can stock up on what they need."
  },
  {
    "category": "Trip Preparation",
    "question_en": "What weather should we expect in Mallorca?",
    "answer_en": "Spring/Autumn (April-May, September-October): 18-25°C, ideal for cycling. Summer (June-August): 25-35°C, hot but manageable with morning departures. Winter (November-March): 12-20°C, mild but possible rain. Mallorca enjoys over 300 days of sunshine a year."
  },
  {
    "category": "Other",
    "question_en": "What is the coaching sessions' schedule?",
    "answer_en": "We offer daily coaching sessions that include: analysis of pedaling technique, strategies for climbs, management of nutrition during exertion, and optimization of the position on the bike. The sessions are personalized based on the level and objectives of each participant."
  },
  {
    "category": "Other",
    "question_en": "Do I have to come with a team?",
    "answer_en": "No, most participants arrive individually or in pairs. One of the most beautiful aspects of our tours is the opportunity to meet new friends who share a passion for cycling. Many friendships born during the tours continue well beyond the trip."
  },
  {
    "category": "Other",
    "question_en": "What happens if it rains?",
    "answer_en": "Mallorca has a Mediterranean climate with rare rainfall, but if it does rain we have alternative plans: covered routes, cultural visits, bike maintenance sessions, or simply relaxation and socializing. The rain in Mallorca is usually short and followed by clear skies."
  },
  {
    "category": "Other",
    "question_en": "What happens if I'm tired one day?",
    "answer_en": "No problem! You can always choose to rest, take a shorter route, or be accompanied by the support vehicle. Your well-being is the priority. Many participants appreciate having a recovery day to explore Palma or simply relax."
  }
]
